<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest x86_64 version of Docker Desktop.</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.download.x86_64.docker</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string>x86_64</string>
        <key>NAME</key>
        <string>Docker</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://desktop.docker.com/mac/main/amd64/appcast.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.ashesamurai.docker.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>