<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads/Packages the latest build of OverSight and imports to Munki</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.munki.oversight</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/objective-see</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>OverSight monitors a mac's mic and webcam, alerting the user when the internal mic is activated, or whenever a process accesses the webcam.</string>
            <key>developer</key>
            <string>Objective-See</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
            <key>supported_architectures</key>
            <array>
                <string>arm64</string>
                <string>x86_64</string>
            </array>
            <key>blocking_applications</key>
            <array>
                <string>OverSight.app</string>
            </array>
            <key>uninstall_script</key>
            <string>
                #
                #  file: configure.sh
                #  project: OverSight (configure)
                #  description: v1.* uninstaller logic
                #
                #  created by Patrick Wardle
                #  copyright (c) 2021 Objective-See. All rights reserved.
                #

                # Slightly modified for munki uninstall script

                #dbg msg
                echo "uninstalling"

                #remove application
                rm -rf "/Applications/OverSight.app"

                #remove preferences, etc.
                rm -rf "${2}"

                killall "OverSight" 2&gt; /dev/null
                killall "com.objective-see.OverSight.helper" 2&gt; /dev/null
                killall "OverSight Helper" 2&gt; /dev/null

                #happy
                exit 0
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.ashesamurai.download.oversight</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>