<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads an imports the latest version of UTM from Github</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.munki.utm</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Stats</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/utm</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Testing</string>
            </array>
            <key>description</key>
            <string>UTM is a full featured system emulator and virtual machine host for iOS and macOS.</string>
            <key>developer</key>
            <string>UTM</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
            <key>supported_architectures</key>
            <array>
                <string>arm64</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.ashesamurai.download.utm</string>
    <key>Process</key>
    <array>
      <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>