<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest arm64 build of Microsoft Edge</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.download.arm64.msedge</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string>arm64</string>
        <key>CHANNEL</key>
        <string>Stable</string>
        <key>LINKID</key>
        <string>2093504</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.ashesamurai.download.msedge</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>