<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest build of Blender for x86_64</string>
    <key>Identifier</key>
    <string>com.github.chaospeach.download.x86_64.blender</string>
    <key>Input</key>
    <dict>
        <key>BASE_VERSION</key>
        <string></string>
        <key>ARCHITECTURE</key>
        <string>x86_64</string>
        <key>MIRROR_OVERRIDE</key>
        <string></string>
        <key>NAME</key>
        <string>Blender</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.chaospeach.download.blender</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>