<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
       <key>Description</key>
    <string>Downloads the latest build of Blender for the specified achitecture and version</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.download.blender</string>
    <key>Input</key>
    <dict>
        <key>BASE_VERSION</key>
        <string>0</string>
        <key>ARCHITECTURE</key>
        <string />
        <key>MIRROR_OVERRIDE</key>
        <string />
        <key>NAME</key>
        <string>Blender Unspecified</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>BlenderURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>base_version</key>
                <string>%BASE_VERSION%</string>
                <key>arch</key>
                <string>%ARCHITECTURE%</string>
                <key>mirror_override_url</key>
                <string>%MIRROR_OVERRIDE%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_url%</string>
                <key>filename</key>
                <string>%download_file%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Blender.app</string>
                <key>requirement</key>
                <string>identifier "org.blenderfoundation.blender" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "68UA947AUU"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>