<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Intel (x86_64) build of Visual Studio Code and creates a DMG for Munki</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.dmg.x86_64.vscode</string>
    <key>Input</key>
    <dict>
        <key>BUILD</key>
        <string>stable</string>
        <key>OS_ARCHITECTURE</key>
        <string>darwin</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.ashesamurai.dmg.vscode</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>