<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest build of Visual Studio Code for the specified achitecture and creates a DMG for Munki</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.dmg.vscode</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.ashesamurai.download.vscode</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_filesystem</key>
                <string>APFS</string>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>