<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest build of Visual Studio Code for the specified achitecture</string>
    <key>Identifier</key>
    <string>com.github.ashesamurai.download.vscode</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VisualStudioCode-%OS_ARCHITECTURE%</string>
        <key>BASE_URL</key>
        <string>https://code.visualstudio.com/sha/download</string>
        <key>BUILD</key>
        <string></string>
        <key>OS_ARCHITECTURE</key>
        <string></string>
        <key>DOWNLOAD_URL</key>
        <string>%BASE_URL%?build=%BUILD%&amp;os=%OS_ARCHITECTURE%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
                <key>purge_destination</key>
                <true />
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Visual Studio Code.app</string>
                <key>requirement</key>
                <string>identifier "com.microsoft.VSCode" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
